app/controllers/appointments_controller.rb

    def index
        render json: Appointment.all, each_serializer: AppointmentSerializer
---
SELECT "appointments".* FROM "appointments"

    def find_appointment
        Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]