app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"
---
    def index
        render json: Employee.all, each_serializer: EmployeeSerializer