app/controllers/services_controller.rb

    def index
        render json: Service.all
---
SELECT "services".* FROM "services"

    def find_service
        Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]